app/Helpers/auth_helper.php

SELECT *
FROM `decl_users`
WHERE `decl_users`.`id` = 1
---
    function logged_user(): ?object
    {
        static $cached = null;
        static $loaded = false;

        if ($loaded) {
            return $cached;
        }
        $loaded = true;

        $id = logged_id();
        if (!$id)
            return null;

        $model = new DeclUserModel();
        $cached = $model->find($id);