app/Models/DeclUserAuthModel.php

SELECT *
FROM `decl_user_auth`
WHERE `decl_user_id` = 1
 LIMIT 1
---
    public function findByUserId(int $userId): ?DeclUserAuth
    {
        /** @var DeclUserAuth|null $auth */
        $auth = $this->where('decl_user_id', $userId)->first();