app/Models/DeclUserModel.php

    public function findActiveByAntraId(string $antraId): ?DeclUser
    {
        /** @var DeclUser|null $user */
        $user = $this->where('antra_id', $antraId)
            ->where('status', 'active')
            ->first();
---
SELECT *
FROM `decl_users`
WHERE `antra_id` = '8533'
AND `status` = 'active'
 LIMIT 1